//1)           10. Згенерувати і вивести на екран масив з 10 випадкових чисел від  -140 до 140, та сформувати інший масив з елементів масиву, які більше 30. 


#include <iostream>
#include <ctime>
#include <cstdlib>

using namespace std;

int main() {
    // --------------------------------------
    srand(static_cast<unsigned int>(time(nullptr)));
  /*
  Залишив static_cast, оскільки він чітко вказує на те, що я здійснюю явне приведення типу. Це допомагає уникнути проблем із неявним приведенням типів
  */
    // --------------------------------------
    const int size = 10;
    int array[size];
    int greater_than_30[size]; // >30
    int count = 0; // для відстеження кількості елементів, більших за 30

    // ------------------------------------------
    cout << "Масив з випадкових чисел:\n";
    for (int i = 0; i < size; ++i) {
        array[i] = rand() % 281 - 140; 
        cout << array[i] << " ";
        if (array[i] > 30) {
            greater_than_30[count] = array[i]; // Зберігаємо елементи, більші за 30
            count++; 
        }
    }
    cout << "\n-------------------" << endl;
    //------------------------------------------
    cout << "\nМасив з елементів, більших за 30:\n";
    if (count == 0) {
        cout << "Немає елементів, більших за 30\n"; 
    } else {
        for (int i = 0; i < count; ++i) {
            cout << greater_than_30[i] << " "; // Вивід > 30
        }
        cout << endl;
    }

    return 0;
}


//2)         10. Ввести квадратну матрицю. Знайти суму елементів тих рядків, у яких на головній діагоналі знаходяться від’ємні числа. 



